src/cf/InformationRegisters/пропуск_ЖурналПосещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>пропуск_ЖурналПосещений</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторПропуска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вход</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/CommonModules/пропуск_РаботаСКонтролллеромТурникетаВызовСервера/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ОткрытьТурникет() Экспорт
	
	Попытка
		Контроллер = ПодключитьКонтроллер();
	Исключение
		Контроллер = Неопределено;
	КонецПопытки;
	
	Если Контроллер = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Состояние = "";
	
	//TODO:
	// Необходимо добавить механизм запроса компоненты котроллера.
	//Если Контроллер.Открыть(Состояние) = Истина Тогда
	Если Истина Тогда
		Возврат Истина;
	Иначе
		ОбщегоНазначения.СообщитьПользователю(Состояние);
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ПодключитьКонтроллер()
	
	Контроллер = ПолучитьОбщийМакет("пропуск_Контроллер");
	
	//TODO:
	// Необходимо добавить механизм подключения компоненты котроллера.
	
	Возврат Контроллер;
	
КонецФункции

Процедура ОтразитьОткрытиеТурникетаПоСотруднику(Сотрудник = Неопределено, ИдентификаторПропуска = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Сотрудник = Неопределено И ИдентификаторПропуска = Неопределено Тогда
		
		Возврат;
		
	ИначеЕсли Сотрудник = Неопределено Тогда
		
		Отбор = Новый Структура;
		Отбор.Вставить("пропуск_ИдентификаторПропуска", ИдентификаторПропуска);
		Выборка = Справочники.Пользователи.Выбрать(,, Отбор);
		
		Если Выборка.Следующий() Тогда
			Сотрудник = Выборка.Ссылка;
		Иначе
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("Сотрудник", Сотрудник);
	ПараметрыЗаписи.Вставить("ИдентификаторПропуска", ИдентификаторПропуска);
	ПараметрыЗаписи.Вставить("Вход", Истина);
	
	ЗаписатьВЖурналПосещений(ПараметрыЗаписи);
	
КонецПроцедуры

Процедура ЗаписатьВЖурналПосещений(ПараметрыЗаписи) Экспорт
	
	ТекущаяДата = ТекущаяДата();
	
	НаборЗаписей = РегистрыСведений.пропуск_ЖурналПосещений.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(ТекущаяДата());
	
	Запись = НаборЗаписей.Добавить();
	Запись.Период = ТекущаяДата;
	Запись.Сотрудник = ПараметрыЗаписи.Сотрудник;
	Запись.ИдентификаторПропуска = ПараметрыЗаписи.ИдентификаторПропуска;
	Запись.Вход = ПараметрыЗаписи.Вход;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйИнтерфейс

#КонецОбласти
